* TOC 
:TOC:

- [[#formatting-nodes-using-a-provided-function-instead-of-the-default-one][formatting nodes using a provided function instead of the default one]]
  - [[#this-is-my-function-and-my-template][this is my function and my template]]
- [[#modified-functions][modified functions.]]
- [[#testing-the-old-code][Testing the old code]]
- [[#testing-the-new-function][testing the new function]]
- [[#replacing-org-roam-node-read-sort-by-file-mtime][replacing org-roam-node-read-sort-by-file-mtime]]
- [[#benchmarking-original-code][Benchmarking original code]]
- [[#benchmarking-using-the-function][Benchmarking using the function]]
- [[#replacing-org-roam-node-read-sort-by-file-mtime-1][replacing org-roam-node-read-sort-by-file-mtime]]
- [[#moving-the-sort-before-the-formatting][moving the sort before the formatting]]
  - [[#profiling][profiling]]
- [[#this-is-how-fast-sort-is][this is how fast sort is]]

* formatting nodes using a provided function instead of the default one

** this is my function and my template

the function dmg-org-roam-format-template does exactly the same as the 
dmg-org-roam-node-display-template

#+begin_src emacs-lisp   :exports both
(setq dmg-org-roam-node-display-template
            (concat 
;              (propertize "${todo:10} " 'face 'org-todo)
              "${todo:10} "
              (propertize "${tags:30} " 'face 'org-tag)
              "${title:40} "
              "${file}"
              ))



(defun dmg-to-string (st)
  (cond
   ((stringp st) st)
   ((listp st) (mapconcat 'identity st " "))
   (t "")))
      

(defun dmg-truncate (st width)
 (truncate-string-to-width (dmg-to-string st) width nil ? ))

(defun dmg-format-todo (st)
  (dmg-truncate
   (concat  (if st "t:" "") st) 10))


(defun dmg-format-tags (tags )
  (dmg-truncate 
   (mapconcat (lambda (tag) (concat "#" tag)) tags " ")
   30))
  
(defun dmg-format-file (file)
  (substring file (length org-roam-directory))
  )


(defun dmg-org-roam-format-template (node)
  (let (
        (formatted-node     (concat
                             (dmg-format-todo (org-roam-node-todo node) )
                             " "
                             (propertize
                              (dmg-format-tags (org-roam-node-tags node)))
                             " "
                             (dmg-truncate (org-roam-node-title node) 40)
                             " "
                             (dmg-format-file
                              (org-roam-node-file node))))
        )
    (cons
     (propertize formatted-node 'node node)
     node
     )))
#+end_src

#+RESULTS:
#+begin_example
dmg-org-roam-format-template
#+end_example


* modified functions.

I changed the name so they will not mess with my emacs


#+begin_src emacs-lisp   :exports both
(defun dmg-org-roam-format-nodes-using-template (nodes)
  (let  (
      (wTemplate (org-roam-node--process-display-format dmg-org-roam-node-display-template))
      )
    (mapcar (lambda (node)
              (org-roam-node-read--to-candidate node wTemplate)) nodes))
  )

(defun dmg-org-roam-format-nodes-using-function (nodes)
  (mapcar dmg-org-roam-node-display-template nodes )
  )

(defun dmg-org-roam-node-read--completions (&optional filter-fn sort-fn)
  "Return an alist for node completion.
The car is the displayed title or alias for the node, and the cdr
is the `org-roam-node'.
FILTER-FN is a function to filter out nodes: it takes an `org-roam-node',
and when nil is returned the node will be filtered out.
SORT-FN is a function to sort nodes. See `org-roam-node-read-sort-by-file-mtime'
for an example sort function.
The displayed title is formatted according to `org-roam-node-display-template'."
  (let* (
         (nodes (org-roam-node-list))
         (nodes (if filter-fn
                    (cl-remove-if-not
                     (lambda (n) (funcall filter-fn n))
                     nodes)
                  nodes))
         (nodes (if (functionp dmg-org-roam-node-display-template)
                    (dmg-org-roam-format-nodes-using-function nodes)
                   (dmg-org-roam-format-nodes-using-template nodes)))

         (sort-fn (or sort-fn
                      (when org-roam-node-default-sort
                        (intern (concat "org-roam-node-read-sort-by-"
                                        (symbol-name org-roam-node-default-sort))))))
         (nodes (if sort-fn (seq-sort sort-fn nodes)
                  nodes)))
    nodes))


#+end_src

#+RESULTS:
#+begin_example
dmg-org-roam-node-read--completions
#+end_example

* Testing the old code

#+begin_src emacs-lisp :exports both
(setq dmg-org-roam-node-display-template
            (concat 
;              (propertize "${todo:10} " 'face 'org-todo)
              "${todo:10} "
              (propertize "${tags:30} " 'face 'org-tag)
              "${title:40} "
              "${file}"
              ))


(mapcar (lambda (x)
          (message "[%S]\n" x))
        (seq-take (dmg-org-roam-node-read--completions) 10))
#+end_src

#+RESULTS:
| [(#("           #daily                         2024-06-20                               daily/2024-06-20.org" 0 11 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "2024-06-20" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil)) 11 41 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "2024-06-20" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil) face org-tag) 41 42 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "2024-06-20" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil) face org-tag) 42 103 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "2024-06-20" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "2024-06-20" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil))]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                           |
| [(#("           #daily                         today                                    daily/2024-06-20.org" 0 11 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "today" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil)) 11 41 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "today" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil) face org-tag) 41 42 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "today" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil) face org-tag) 42 103 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "today" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "today" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil))]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    |
| [(#("           #p_einit                       org-roam config                          links/.emacs.d/dmg-org-roam.org" 0 11 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org" "org-roam config" nil (26228 53846 462871 360000) (26228 53827 556569 181000) "id-20240531-214336" 0 1 nil nil nil nil "org-roam config" (("CATEGORY" . "emacs-configuration") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240531-214336") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil)) 11 41 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org" "org-roam config" nil (26228 53846 462871 360000) (26228 53827 556569 181000) "id-20240531-214336" 0 1 nil nil nil nil "org-roam config" (("CATEGORY" . "emacs-configuration") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240531-214336") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil) face org-tag) 41 42 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org" "org-roam config" nil (26228 53846 462871 360000) (26228 53827 556569 181000) "id-20240531-214336" 0 1 nil nil nil nil "org-roam config" (("CATEGORY" . "emacs-configuration") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240531-214336") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil) face org-tag) 42 114 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org" "org-roam config" nil (26228 53846 462871 360000) (26228 53827 556569 181000) "id-20240531-214336" 0 1 nil nil nil nil "org-roam config" (("CATEGORY" . "emacs-configuration") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240531-214336") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org" "org-roam config" nil (26228 53846 462871 360000) (26228 53827 556569 181000) "id-20240531-214336" 0 1 nil nil nil nil "org-roam config" (("CATEGORY" . "emacs-configuration") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240531-214336") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil))]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |
| [(#("                                          ref 3d prints                            refs/ref_3d_prints.org" 0 11 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56" 0 1 nil nil nil nil "ref 3d prints" (("CATEGORY" . "ref_3d_prints") ("ID" . "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B")) nil nil nil nil)) 11 41 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56" 0 1 nil nil nil nil "ref 3d prints" (("CATEGORY" . "ref_3d_prints") ("ID" . "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B")) nil nil nil nil) face org-tag) 41 42 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56" 0 1 nil nil nil nil "ref 3d prints" (("CATEGORY" . "ref_3d_prints") ("ID" . "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B")) nil nil nil nil) face org-tag) 42 105 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56" 0 1 nil nil nil nil "ref 3d prints" (("CATEGORY" . "ref_3d_prints") ("ID" . "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B")) nil nil nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56" 0 1 nil nil nil nil "ref 3d prints" (("CATEGORY" . "ref_3d_prints") ("ID" . "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B")) nil nil nil nil))]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
| [(#("                                          multiboard wall storage                  refs/ref_3d_prints.org" 0 11 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "id-20240618-095302" 1 804 nil nil nil nil "multiboard wall storage" (("CATEGORY" . "ref_3d_prints") ("ID" . "id-20240618-095302") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B") ("ITEM" . "multiboard wall storage")) nil nil nil nil)) 11 41 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "id-20240618-095302" 1 804 nil nil nil nil "multiboard wall storage" (("CATEGORY" . "ref_3d_prints") ("ID" . "id-20240618-095302") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B") ("ITEM" . "multiboard wall storage")) nil nil nil nil) face org-tag) 41 42 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "id-20240618-095302" 1 804 nil nil nil nil "multiboard wall storage" (("CATEGORY" . "ref_3d_prints") ("ID" . "id-20240618-095302") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B") ("ITEM" . "multiboard wall storage")) nil nil nil nil) face org-tag) 42 105 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "id-20240618-095302" 1 804 nil nil nil nil "multiboard wall storage" (("CATEGORY" . "ref_3d_prints") ("ID" . "id-20240618-095302") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B") ("ITEM" . "multiboard wall storage")) nil nil nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "id-20240618-095302" 1 804 nil nil nil nil "multiboard wall storage" (("CATEGORY" . "ref_3d_prints") ("ID" . "id-20240618-095302") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B") ("ITEM" . "multiboard wall storage")) nil nil nil nil))]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 |
| [(#("           #dmgTodo #imp #p_474 #uvic     proj seng474 dm mine                     proj/seng474k24.org" 0 11 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org" "proj seng474 dm mine" nil (26228 53739 568321 453000) (26228 35458 543085 936000) "0D69C2B1-F072-4F59-B949-CFA7F0F25807" 0 1 nil nil nil nil "proj seng474 dm mine" (("CATEGORY" . "seng474k24") ("ID" . "0D69C2B1-F072-4F59-B949-CFA7F0F25807") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":dmgTodo:imp:uvic:p_474:" 1 8 (inherited t) 9 12 (inherited t) 13 17 (inherited t) 18 23 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org") ("PRIORITY" . "B")) nil ("dmgTodo" "imp" "p_474" "uvic") nil nil)) 11 41 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org" "proj seng474 dm mine" nil (26228 53739 568321 453000) (26228 35458 543085 936000) "0D69C2B1-F072-4F59-B949-CFA7F0F25807" 0 1 nil nil nil nil "proj seng474 dm mine" (("CATEGORY" . "seng474k24") ("ID" . "0D69C2B1-F072-4F59-B949-CFA7F0F25807") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":dmgTodo:imp:uvic:p_474:" 1 8 (inherited t) 9 12 (inherited t) 13 17 (inherited t) 18 23 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org") ("PRIORITY" . "B")) nil ("dmgTodo" "imp" "p_474" "uvic") nil nil) face org-tag) 41 42 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org" "proj seng474 dm mine" nil (26228 53739 568321 453000) (26228 35458 543085 936000) "0D69C2B1-F072-4F59-B949-CFA7F0F25807" 0 1 nil nil nil nil "proj seng474 dm mine" (("CATEGORY" . "seng474k24") ("ID" . "0D69C2B1-F072-4F59-B949-CFA7F0F25807") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":dmgTodo:imp:uvic:p_474:" 1 8 (inherited t) 9 12 (inherited t) 13 17 (inherited t) 18 23 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org") ("PRIORITY" . "B")) nil ("dmgTodo" "imp" "p_474" "uvic") nil nil) face org-tag) 42 102 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org" "proj seng474 dm mine" nil (26228 53739 568321 453000) (26228 35458 543085 936000) "0D69C2B1-F072-4F59-B949-CFA7F0F25807" 0 1 nil nil nil nil "proj seng474 dm mine" (("CATEGORY" . "seng474k24") ("ID" . "0D69C2B1-F072-4F59-B949-CFA7F0F25807") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":dmgTodo:imp:uvic:p_474:" 1 8 (inherited t) 9 12 (inherited t) 13 17 (inherited t) 18 23 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org") ("PRIORITY" . "B")) nil ("dmgTodo" "imp" "p_474" "uvic") nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org" "proj seng474 dm mine" nil (26228 53739 568321 453000) (26228 35458 543085 936000) "0D69C2B1-F072-4F59-B949-CFA7F0F25807" 0 1 nil nil nil nil "proj seng474 dm mine" (("CATEGORY" . "seng474k24") ("ID" . "0D69C2B1-F072-4F59-B949-CFA7F0F25807") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":dmgTodo:imp:uvic:p_474:" 1 8 (inherited t) 9 12 (inherited t) 13 17 (inherited t) 18 23 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org") ("PRIORITY" . "B")) nil ("dmgTodo" "imp" "p_474" "uvic") nil nil))] |
| [(#("                                          ref bus route Schedule bctransit         refs/busroutes.org" 0 11 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org" "ref bus route Schedule bctransit" nil (26228 53738 67752 733000) (26228 34592 210252 624000) "A899680C-1E50-4457-ADB3-AB8331618D17" 0 1 nil nil nil nil "ref bus route Schedule bctransit" (("CATEGORY" . "busroutes") ("ID" . "A899680C-1E50-4457-ADB3-AB8331618D17") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org") ("PRIORITY" . "B")) nil nil nil nil)) 11 41 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org" "ref bus route Schedule bctransit" nil (26228 53738 67752 733000) (26228 34592 210252 624000) "A899680C-1E50-4457-ADB3-AB8331618D17" 0 1 nil nil nil nil "ref bus route Schedule bctransit" (("CATEGORY" . "busroutes") ("ID" . "A899680C-1E50-4457-ADB3-AB8331618D17") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org") ("PRIORITY" . "B")) nil nil nil nil) face org-tag) 41 42 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org" "ref bus route Schedule bctransit" nil (26228 53738 67752 733000) (26228 34592 210252 624000) "A899680C-1E50-4457-ADB3-AB8331618D17" 0 1 nil nil nil nil "ref bus route Schedule bctransit" (("CATEGORY" . "busroutes") ("ID" . "A899680C-1E50-4457-ADB3-AB8331618D17") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org") ("PRIORITY" . "B")) nil nil nil nil) face org-tag) 42 101 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org" "ref bus route Schedule bctransit" nil (26228 53738 67752 733000) (26228 34592 210252 624000) "A899680C-1E50-4457-ADB3-AB8331618D17" 0 1 nil nil nil nil "ref bus route Schedule bctransit" (("CATEGORY" . "busroutes") ("ID" . "A899680C-1E50-4457-ADB3-AB8331618D17") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org") ("PRIORITY" . "B")) nil nil nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org" "ref bus route Schedule bctransit" nil (26228 53738 67752 733000) (26228 34592 210252 624000) "A899680C-1E50-4457-ADB3-AB8331618D17" 0 1 nil nil nil nil "ref bus route Schedule bctransit" (("CATEGORY" . "busroutes") ("ID" . "A899680C-1E50-4457-ADB3-AB8331618D17") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org") ("PRIORITY" . "B")) nil nil nil nil))]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         |
| [(#("           #jp                            proj bite-size-japanese                  proj/bite_size_japanese.org" 0 11 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "4E8A3035-4EAC-4F51-963F-78D36E325DE3" 0 1 nil nil nil nil "proj bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ORG_GTD" . "Projects") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "4E8A3035-4EAC-4F51-963F-78D36E325DE3") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B")) nil ("jp") nil nil)) 11 41 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "4E8A3035-4EAC-4F51-963F-78D36E325DE3" 0 1 nil nil nil nil "proj bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ORG_GTD" . "Projects") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "4E8A3035-4EAC-4F51-963F-78D36E325DE3") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B")) nil ("jp") nil nil) face org-tag) 41 42 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "4E8A3035-4EAC-4F51-963F-78D36E325DE3" 0 1 nil nil nil nil "proj bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ORG_GTD" . "Projects") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "4E8A3035-4EAC-4F51-963F-78D36E325DE3") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B")) nil ("jp") nil nil) face org-tag) 42 110 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "4E8A3035-4EAC-4F51-963F-78D36E325DE3" 0 1 nil nil nil nil "proj bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ORG_GTD" . "Projects") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "4E8A3035-4EAC-4F51-963F-78D36E325DE3") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B")) nil ("jp") nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "4E8A3035-4EAC-4F51-963F-78D36E325DE3" 0 1 nil nil nil nil "proj bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ORG_GTD" . "Projects") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "4E8A3035-4EAC-4F51-963F-78D36E325DE3") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B")) nil ("jp") nil nil))]                                                                                                                                                                                                                                                             |
| [(#("t:PROJ     #jp                            bite-size-japanese                       proj/bite_size_japanese.org" 0 11 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "bite-size-japanese-2023-10-26" 1 235 "PROJ" nil nil nil "bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ID" . "bite-size-japanese-2023-10-26") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B") ("TODO" . "PROJ") ("ITEM" . "bite-size-japanese")) nil ("jp") nil nil)) 11 41 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "bite-size-japanese-2023-10-26" 1 235 "PROJ" nil nil nil "bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ID" . "bite-size-japanese-2023-10-26") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B") ("TODO" . "PROJ") ("ITEM" . "bite-size-japanese")) nil ("jp") nil nil) face org-tag) 41 42 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "bite-size-japanese-2023-10-26" 1 235 "PROJ" nil nil nil "bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ID" . "bite-size-japanese-2023-10-26") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B") ("TODO" . "PROJ") ("ITEM" . "bite-size-japanese")) nil ("jp") nil nil) face org-tag) 42 110 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "bite-size-japanese-2023-10-26" 1 235 "PROJ" nil nil nil "bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ID" . "bite-size-japanese-2023-10-26") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B") ("TODO" . "PROJ") ("ITEM" . "bite-size-japanese")) nil ("jp") nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "bite-size-japanese-2023-10-26" 1 235 "PROJ" nil nil nil "bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ID" . "bite-size-japanese-2023-10-26") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B") ("TODO" . "PROJ") ("ITEM" . "bite-size-japanese")) nil ("jp") nil nil))]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   |
| [(#("           #p_einit                       org configuration for emacs              links/.emacs.d/dmg-org.org" 0 11 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org" "org configuration for emacs" nil (26228 28472 616572 535000) (26227 52771 117332 505000) "id-20240601-132534" 0 1 nil nil nil nil "org configuration for emacs" (("CATEGORY" . "") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240601-132534") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil)) 11 41 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org" "org configuration for emacs" nil (26228 28472 616572 535000) (26227 52771 117332 505000) "id-20240601-132534" 0 1 nil nil nil nil "org configuration for emacs" (("CATEGORY" . "") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240601-132534") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil) face org-tag) 41 42 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org" "org configuration for emacs" nil (26228 28472 616572 535000) (26227 52771 117332 505000) "id-20240601-132534" 0 1 nil nil nil nil "org configuration for emacs" (("CATEGORY" . "") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240601-132534") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil) face org-tag) 42 109 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org" "org configuration for emacs" nil (26228 28472 616572 535000) (26227 52771 117332 505000) "id-20240601-132534" 0 1 nil nil nil nil "org configuration for emacs" (("CATEGORY" . "") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240601-132534") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org" "org configuration for emacs" nil (26228 28472 616572 535000) (26227 52771 117332 505000) "id-20240601-132534" 0 1 nil nil nil nil "org configuration for emacs" (("CATEGORY" . "") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240601-132534") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil))]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                   |

* testing the new function


#+begin_src emacs-lisp :exports both
(setq dmg-org-roam-node-display-template 'dmg-org-roam-format-template)

(mapcar (lambda (x)
          (message "[%S]\n" x))
        (seq-take (dmg-org-roam-node-read--completions) 10))
#+end_src

#+RESULTS:
| [(#("           #daily                         2024-06-20                               /daily/2024-06-20.org" 0 104 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "2024-06-20" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "2024-06-20" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil))]                                                                                                                                                                                              |
| [(#("           #daily                         today                                    /daily/2024-06-20.org" 0 104 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "today" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org" "2024-06-20" nil (26229 376 717300 847000) (26229 376 701056 977000) "id-20240620-114534" 0 1 nil nil nil nil "today" (("CATEGORY" . "2024-06-20") ("ROAM_ALIASES" . "today") ("ID" . "id-20240620-114534") ("STARTUP" . "inlineimages") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":daily:" 1 6 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/daily/2024-06-20.org") ("PRIORITY" . "B")) nil ("daily") ("today") nil))]                                                                                                                                                                                                        |
| [(#("           #p_einit                       org-roam config                          /links/.emacs.d/dmg-org-roam.org" 0 115 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org" "org-roam config" nil (26228 53846 462871 360000) (26228 53827 556569 181000) "id-20240531-214336" 0 1 nil nil nil nil "org-roam config" (("CATEGORY" . "emacs-configuration") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240531-214336") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org" "org-roam config" nil (26228 53846 462871 360000) (26228 53827 556569 181000) "id-20240531-214336" 0 1 nil nil nil nil "org-roam config" (("CATEGORY" . "emacs-configuration") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240531-214336") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org-roam.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil))]                                                                                                                                                                                                                       |
| [(#("                                          ref 3d prints                            /refs/ref_3d_prints.org" 0 106 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56" 0 1 nil nil nil nil "ref 3d prints" (("CATEGORY" . "ref_3d_prints") ("ID" . "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B")) nil nil nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56" 0 1 nil nil nil nil "ref 3d prints" (("CATEGORY" . "ref_3d_prints") ("ID" . "8FE29BC1-84AE-47F1-9811-23F2CC6FDB56") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B")) nil nil nil nil))]                                                                                                                                                                                                                                                                                                                                                                                                                                                                      |
| [(#("                                          multiboard wall storage                  /refs/ref_3d_prints.org" 0 106 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "id-20240618-095302" 1 804 nil nil nil nil "multiboard wall storage" (("CATEGORY" . "ref_3d_prints") ("ID" . "id-20240618-095302") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B") ("ITEM" . "multiboard wall storage")) nil nil nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org" "ref 3d prints" nil (26228 42907 588963 745000) (26228 42907 547438 617000) "id-20240618-095302" 1 804 nil nil nil nil "multiboard wall storage" (("CATEGORY" . "ref_3d_prints") ("ID" . "id-20240618-095302") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/ref_3d_prints.org") ("PRIORITY" . "B") ("ITEM" . "multiboard wall storage")) nil nil nil nil))]                                                                                                                                                                                                                                                                                                                                                                                                                                            |
| [(#("           #dmgTodo #imp #p_474 #uvic     proj seng474 dm mine                     /proj/seng474k24.org" 0 103 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org" "proj seng474 dm mine" nil (26228 53739 568321 453000) (26228 35458 543085 936000) "0D69C2B1-F072-4F59-B949-CFA7F0F25807" 0 1 nil nil nil nil "proj seng474 dm mine" (("CATEGORY" . "seng474k24") ("ID" . "0D69C2B1-F072-4F59-B949-CFA7F0F25807") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":dmgTodo:imp:uvic:p_474:" 1 8 (inherited t) 9 12 (inherited t) 13 17 (inherited t) 18 23 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org") ("PRIORITY" . "B")) nil ("dmgTodo" "imp" "p_474" "uvic") nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org" "proj seng474 dm mine" nil (26228 53739 568321 453000) (26228 35458 543085 936000) "0D69C2B1-F072-4F59-B949-CFA7F0F25807" 0 1 nil nil nil nil "proj seng474 dm mine" (("CATEGORY" . "seng474k24") ("ID" . "0D69C2B1-F072-4F59-B949-CFA7F0F25807") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("BLOCKED" . "") ("ALLTAGS" . #(":dmgTodo:imp:uvic:p_474:" 1 8 (inherited t) 9 12 (inherited t) 13 17 (inherited t) 18 23 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/seng474k24.org") ("PRIORITY" . "B")) nil ("dmgTodo" "imp" "p_474" "uvic") nil nil))] |
| [(#("                                          ref bus route Schedule bctransit         /refs/busroutes.org" 0 102 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org" "ref bus route Schedule bctransit" nil (26228 53738 67752 733000) (26228 34592 210252 624000) "A899680C-1E50-4457-ADB3-AB8331618D17" 0 1 nil nil nil nil "ref bus route Schedule bctransit" (("CATEGORY" . "busroutes") ("ID" . "A899680C-1E50-4457-ADB3-AB8331618D17") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org") ("PRIORITY" . "B")) nil nil nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org" "ref bus route Schedule bctransit" nil (26228 53738 67752 733000) (26228 34592 210252 624000) "A899680C-1E50-4457-ADB3-AB8331618D17" 0 1 nil nil nil nil "ref bus route Schedule bctransit" (("CATEGORY" . "busroutes") ("ID" . "A899680C-1E50-4457-ADB3-AB8331618D17") ("BLOCKED" . "") ("FILE" . "/Users/dmg/tmDropbox/org/roam/refs/busroutes.org") ("PRIORITY" . "B")) nil nil nil nil))]                                                                                                                                                                                                                                                                                                                                                                                                                        |
| [(#("           #jp                            proj bite-size-japanese                  /proj/bite_size_japanese.org" 0 111 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "4E8A3035-4EAC-4F51-963F-78D36E325DE3" 0 1 nil nil nil nil "proj bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ORG_GTD" . "Projects") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "4E8A3035-4EAC-4F51-963F-78D36E325DE3") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B")) nil ("jp") nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "4E8A3035-4EAC-4F51-963F-78D36E325DE3" 0 1 nil nil nil nil "proj bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ORG_GTD" . "Projects") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "4E8A3035-4EAC-4F51-963F-78D36E325DE3") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B")) nil ("jp") nil nil))]                                                                                                 |
| [(#("t:PROJ     #jp                            bite-size-japanese                       /proj/bite_size_japanese.org" 0 111 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "bite-size-japanese-2023-10-26" 1 235 "PROJ" nil nil nil "bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ID" . "bite-size-japanese-2023-10-26") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B") ("TODO" . "PROJ") ("ITEM" . "bite-size-japanese")) nil ("jp") nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org" "proj bite-size-japanese" nil (26228 53740 223814 577000) (26228 30790 29123 81000) "bite-size-japanese-2023-10-26" 1 235 "PROJ" nil nil nil "bite-size-japanese" (("CATEGORY" . "bite_size_japanese") ("ID" . "bite-size-japanese-2023-10-26") ("BLOCKED" . "") ("ALLTAGS" . #(":jp:" 1 3 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/proj/bite_size_japanese.org") ("PRIORITY" . "B") ("TODO" . "PROJ") ("ITEM" . "bite-size-japanese")) nil ("jp") nil nil))]                                                                                                                                                                                                                             |
| [(#("           #p_einit                       org configuration for emacs              /links/.emacs.d/dmg-org.org" 0 110 (node #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org" "org configuration for emacs" nil (26228 28472 616572 535000) (26227 52771 117332 505000) "id-20240601-132534" 0 1 nil nil nil nil "org configuration for emacs" (("CATEGORY" . "") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240601-132534") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil))) . #s(org-roam-node "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org" "org configuration for emacs" nil (26228 28472 616572 535000) (26227 52771 117332 505000) "id-20240601-132534" 0 1 nil nil nil nil "org configuration for emacs" (("CATEGORY" . "") ("TRIGGER" . "org-gtd-next-project-action org-gtd-update-project-task!") ("ID" . "id-20240601-132534") ("BLOCKED" . "") ("ALLTAGS" . #(":p_einit:" 1 8 (inherited t))) ("FILE" . "/Users/dmg/tmDropbox/org/roam/links/.emacs.d/dmg-org.org") ("PRIORITY" . "B")) nil ("p_einit") nil nil))]                                                                                                                                                                                                                                      |


* replacing org-roam-node-read-sort-by-file-mtime
this should reduce time

#+begin_src emacs-lisp   :exports both
(defun org-roam-node-read-sort-by-file-mtime (a b)
  "Sort files such that files modified more recently are shown first.
COMPLETION-A and COMPLETION-B are items in the form of
\(node-title org-roam-node-struct)"
  (time-less-p (org-roam-node-file-mtime (car b))
               (org-roam-node-file-mtime (car a))))
#+end_src





* Benchmarking original code

#+begin_src emacs-lisp   :exports both
(setq dmg-org-roam-node-display-template
            (concat 
;              (propertize "${todo:10} " 'face 'org-todo)
              "${todo:10} "
              (propertize "${tags:30} " 'face 'org-tag)
              "${title:40} "
              "${file}"
              ))

(cl-loop
 for i from 1 to 10
 collect (benchmark-run 1
            (dmg-org-roam-node-read--completions)
           ))
#+end_src

#+RESULTS:
|  0.82144 | 1 | 0.18905800000000283 |
| 0.915326 | 1 | 0.30098600000000175 |
|  0.93741 | 1 |  0.3307259999999985 |
| 0.605876 | 0 |                 0.0 |
| 0.922112 | 1 | 0.31555999999999784 |
| 0.938645 | 1 |  0.3224129999999974 |
| 0.990132 | 1 |  0.3805240000000012 |
| 0.831054 | 1 | 0.21911899999999918 |
| 0.846656 | 1 |   0.225399000000003 |
| 0.852095 | 1 | 0.24280999999999864 |

* Benchmarking using the function


#+begin_src emacs-lisp   :exports both
(setq dmg-org-roam-node-display-template 'dmg-org-roam-format-template)

(cl-loop
 for i from 1 to 10
 collect (benchmark-run 1
            (dmg-org-roam-node-read--completions)
           ))
#+end_src

#+RESULTS:
|            0.366621 | 1 |  0.2705669999999998 |
|            0.086179 | 0 |                 0.0 |
|            0.088205 | 0 |                 0.0 |
|            0.086823 | 0 |                 0.0 |
|            0.087306 | 0 |                 0.0 |
|             0.08823 | 0 |                 0.0 |
|            0.088295 | 0 |                 0.0 |
| 0.29150600000000004 | 1 | 0.20423600000000164 |
|            0.089594 | 0 |                 0.0 |
|            0.088008 | 0 |                 0.0 |



* replacing org-roam-node-read-sort-by-file-mtime
this should reduce the garbage collection a tiny bit

#+begin_src emacs-lisp   :exports both
(defun org-roam-node-read-sort-by-file-mtime (a b)
  "Sort files such that files modified more recently are shown first.
COMPLETION-A and COMPLETION-B are items in the form of
\(node-title org-roam-node-struct)"
  (time-less-p (org-roam-node-file-mtime (cdr b))
               (org-roam-node-file-mtime (cdr a))))
#+end_src

#+RESULTS:
#+begin_example
org-roam-node-read-sort-by-file-mtime
#+end_example

#+begin_src emacs-lisp   :exports both
(setq dmg-org-roam-node-display-template 'dmg-org-roam-format-template)

(cl-loop
 for i from 1 to 10
 collect (benchmark-run 1
            (dmg-org-roam-node-read--completions)
           ))
#+end_src

#+RESULTS:
|            0.102163 | 0 |                0.0 |
|            0.084623 | 0 |                0.0 |
|            0.084103 | 0 |                0.0 |
| 0.27418000000000003 | 1 | 0.1910389999999964 |
|            0.082698 | 0 |                0.0 |
|            0.081804 | 0 |                0.0 |
|            0.082458 | 0 |                0.0 |
|            0.083068 | 0 |                0.0 |
|            0.083246 | 0 |                0.0 |
|             0.08399 | 0 |                0.0 |


* moving the sort before the formatting

this does nothing

#+begin_src emacs-lisp   :exports both
(defun org-roam-node-read-sort-by-file-mtime-ver2 (a b)
  "Sort files such that files modified more recently are shown first.
COMPLETION-A and COMPLETION-B are items in the form of
\(node-title org-roam-node-struct)"
  (time-less-p (org-roam-node-file-mtime b)
               (org-roam-node-file-mtime a)))

(defun dmg-org-roam-node-read--completions-ver2 (&optional filter-fn sort-fn)
  "Return an alist for node completion.
The car is the displayed title or alias for the node, and the cdr
is the `org-roam-node'.
FILTER-FN is a function to filter out nodes: it takes an `org-roam-node',
and when nil is returned the node will be filtered out.
SORT-FN is a function to sort nodes. See `org-roam-node-read-sort-by-file-mtime'
for an example sort function.
The displayed title is formatted according to `org-roam-node-display-template'."
  (let* (
         (nodes (org-roam-node-list))
         (nodes (if filter-fn
                    (cl-remove-if-not
                     (lambda (n) (funcall filter-fn n))
                     nodes)
                  nodes))
         (nodes (seq-sort 'org-roam-node-read-sort-by-file-mtime-ver2 nodes))

         (nodes (if (functionp dmg-org-roam-node-display-template)
                    (dmg-org-roam-format-nodes-using-function nodes)
                   (dmg-org-roam-format-nodes-using-template nodes)))
         )
    nodes))


#+end_src

#+RESULTS:
#+begin_example
dmg-org-roam-node-read--completions-ver2
#+end_example

#+begin_src emacs-lisp   :exports both
(setq dmg-org-roam-node-display-template 'dmg-org-roam-format-template)

(cl-loop
 for i from 1 to 10
 collect (benchmark-run 1
            (dmg-org-roam-node-read--completions-ver2)
           ))
#+end_src

#+RESULTS:
|            0.096256 | 0 |                 0.0 |
|            0.082856 | 0 |                 0.0 |
|            0.082528 | 0 |                 0.0 |
|            0.082071 | 0 |                 0.0 |
|            0.083141 | 0 |                 0.0 |
| 0.27509700000000004 | 1 | 0.19386300000000034 |
|            0.083071 | 0 |                 0.0 |
|            0.085745 | 0 |                 0.0 |
|            0.084448 | 0 |                 0.0 |
|             0.08376 | 0 |                 0.0 |


** profiling

#+begin_src emacs-lisp   :exports both
(setq dmg-org-roam-node-display-template 'dmg-org-roam-format-template)

(profiler-start 'cpu)
(dotimes (i 10)
 (dmg-org-roam-node-read--completions-ver2)
 )
(profiler-stop)
#+end_src

#+RESULTS:
#+begin_example
CPU profiler stopped
#+end_example

* this is how fast sort is
sorting 10^6 random ints

i guess sorting in place is more expensive than generating a list


#+begin_src emacs-lisp   :exports both :results output
;;; -*- lexical-binding: t; -*-
(require 'dash)
(require 'seq)
(require 'cl-lib)

(setq million
      (mapcar 'random
      (number-sequence 1 1000000)))

(let ((gc-cons-threshold 999999999)
      (time) (result))
  (print "sort\n")
  (garbage-collect)
  (setq nmillion million)
  (setq time (float-time))
  (setq result (sort nmillion '<))
  (print (- (float-time) time)))

(let ((gc-cons-threshold 999999999)
      (time) (result))
  (print "seq-sort\n")
  (garbage-collect)
  (setq nmillion million)
  (setq time (float-time))
  (setq result (seq-sort '< nmillion ))
  (print (- (float-time) time)))
#+end_src

#+RESULTS:
#+begin_example

"sort
"

0.6713299751281738

"seq-sort
"

0.07315802574157715
#+end_example
